# #Списки
# list1 = [1, 'r', 1.54, True]

# for i in range(len(list1)):
#     print(list1[i])


# # Добавление элементов в список
# list1.append(5)  #в конец
# print(list1)

# # Кортеж - неизменяемый список

# t = tuple()
# t = ()

#------------------------------------------------------------------------------------------------------------------------------------
# Множество - хранятся ТОЛЬКО УНИКАЛЬНЫЕ элемены

# set1 = {5, 25, 7, 89, 3}
# print(set1) # невозможно индексировать
# # Добавление элементорв
# set1.add(18)
# print(set1)

#--------------------------------------------------------------------------------------------------------------------------------------
#СЛОВАРЬ
# Похож на список, но элемент находится не по индексу, а по уникальному ключу

# dict1 = {}
# dict2 = dict()
# print(dict2)
# dict2['ghjg'] = 45 #dict2[ключ] = значение
# print(dict2)
# dict2['ytgh'] = 5
# print(dict2)

#ЗАДАЧА - сколько уникальных значений в списке
# list1 = [1, 1, 2, 0, -1, 3, 4, 4]
# set1 = set(list1)
# print(set1)
# print(len(set1))

# посчитать колическтво элементов массива больших предыдущего

# list1 = [0, -1, 5, 2, 3, 9]

# i = 0
# x = 0
# for i in range(len(list1) - 1):
#     if list1[i] < list1[i + 1]:
#         x += 1
#     else:
#         x += 0
# print(x)

# ЗАДАЧА 3
# Дана последовательность из N целых чисел и число K.
# Необходимо сдвинуть всю последовательностть (сдвиг циклический) на К элементов вправо. К - положительное число

# k = 3
# list1 = [1, 2, 3, 4, 5] 
# k = int(input('Введите значение K \n'))
# res_list = []
# if k > len(list1):
#     k = k % len(list1)
# for i in range(k):
#     res_list.append(list1[len(list1) - k + i])
# for i in range(len(list1) -k):
#     res_list.append(list1[i])
#     i += 1
# print(res_list)

# ЗАДАЧА 4
# Напишите программу для печати всех уникальных значений в словаре. 

# Input:  [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"}, {"V":"S009"}, {"VIII":"S007"}] 
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# Примечание: Список словарей задан изначально. Пользователь его не вводит

# list1 = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"}, {"V":"S009"}, {"VIII":"S007"}] 
# set_res = set()
# for dict_i in list1:
#     for key in dict_i.keys():
#         set_res.add(dict_i[key])

# print(set_res)

n = int(input('Укажите длину списка \n'))
list1 = []
for i in range(n):
    x = int(input('Введите очередной элемент \n'))
    list1.append(x)
print(list1)